package PAL_v3;

import java.io.IOException;

public class map {
	
public static void roomXiaoYao(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@з╔вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"б║б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@вiб@б@б@б@б@▒Kвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@┬dвiвiвiвiб@∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@│p╗╗й╨╢бб@б@б@б@\r\n" + 
				"");
	}
	public static void roomXiaoYao_1(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@з╔вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@│pб@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@┬Tб@б@б@вiвi∙°\r\n" + 
				"б║б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@вiб@б@б@б@б@▒Kвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@┬dвiвiвiвiб@∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@│p╗╗й╨╢бб@б@б@б@\r\n" + 
				"");
	}
	
public static void roomXiaoYao_2(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@з╔вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"б║б@б@б@б@│pб@б@б@б@б@∙°\r\n" + 
				"∙°б@б@вiб@б@б@б@б@▒Kвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@┬dвiвiвiвiб@∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@│p╗╗й╨╢бб@б@б@б@" + 
				"");
	}
	
public static void SecondFloor(){
	
	System.out.print(
			"вдвдвдвдвдвд∙свдвдвд\r\n" + 
			"б@б@б@б@б@б@∙°\r\n" + 
			"б@▒шб╖∙°б@б@б║н]дHл╚й╨\r\n" + 
			"б@б@б@∙°б@б@∙°\r\n" + 
			"б@б@б@∙°б@│p∙°\r\n" + 
			"б@б@б@∙°б@б@∙рвдвдвд\r\n" + 
			"б@б@б@∙°б@б@∙°\r\n" + 
			"б@б@б@∙°б@б@б║│p╗╗й╨\r\n" + 
			"б@б@б@∙°б@б@∙°\r\n" + 
			"б@б@б@∙°б@вi∙°\r\n" + 
			"вдвдвдвдвдвд∙свдвдвд\r\n" + 
			"б@б@б@дG╝╙ил┤Yб@б@\r\n" + 
			"");
}

	public static void SecondFloor_1(){
		
		System.out.print(
				"вдвдвдвдвдвд∙свдвдвд\r\n" + 
				"б@б@б@б@б@б@∙°\r\n" + 
				"б@▒шб╖∙°б@н]б║н]дHл╚й╨\r\n" + 
				"б@б@б@∙°н]б@∙°\r\n" + 
				"б@б@б@∙°б@┬T∙°\r\n" + 
				"б@б@б@∙°б@б@∙рвдвдвд\r\n" + 
				"б@б@б@∙°б@б@∙°\r\n" + 
				"б@б@б@∙°б@│pб║│p╗╗й╨\r\n" + 
				"б@б@б@∙°б@б@∙°\r\n" + 
				"б@б@б@∙°б@вi∙°\r\n" + 
				"вдвдвдвдвдвд∙свдвдвд\r\n" + 
				"б@б@б@дG╝╙ил┤Yб@б@\r\n" + 
				"");
	}
	
	public static void lobby(){
		
		System.out.print(
				"б@б@б@╝pб@б@б@б@б@б@б@б@\r\n" + 
				"∙свдвдб║вдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiб@б@б@б@б@б@б@▒шб╖∙°\r\n" + 
				"∙°┬dб@б@б@б@б@б@б@б@б@б║зїдjоQй╨\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@│p∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙рвдвдвд\r\n" + 
				"б║╛Kб@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@вiб@б@б@вiб@б@б@б║оуй╨\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@┬dвi∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@д@╝╙дj╞Uб@б@б@\r\n" + 
				"");
	}
	
public static void room1(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@з╔вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@н]б@б@б@б@вiвi∙°\r\n" + 
				"б║│pб@б@вiн]б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@┬dвiвiвiвiб@∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@н]дHл╚й╨б@б@б@б@\r\n" + 
				"");
	}
	
public static void room2(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@з╔вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@вiвi∙°\r\n" + 
				"б║│pб@б@вiб@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@┬dвiвiвiвiб@∙°\r\n" + 
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@зїдjоQй╨б@б@б@б@б@\r\n" + 
				"");
	}

	public static void room3(){
	
	System.out.print(
			"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
			"∙°вовововооуб@б@б@б@б@∙°\r\n" + 
			"∙°вовововоб@б@б@б@б@б@∙°\r\n" + 
			"∙°б@б@б@б@б@б@б@б@▒Kвi∙°\r\n" + 
			"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
			"б║│pб@б@б@б@б@б@б@б@б@∙°\r\n" + 
			"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
			"∙°б@б@б@б@б@вовововово∙°\r\n" + 
			"∙°б@б@б@б@оувовововово∙°\r\n" + 
			"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
			"б@б@б@б@оуй╨б@б@б@б@б@\r\n" + 
			"");
}
	
public static void Kitchen(){
		
		System.out.print(
				"∙свдвдвдвдвдвдвдвдвдвд∙с\r\n" + 
				"∙°вiвiвiвi┬dб@б@б@и_вi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@вi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@вi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@┬Tб@вi∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@б@б@б@∙°\r\n" + 
				"∙°б@б@б@б@б@б@б@вiвiвi∙°\r\n" + 
				"∙°б@б@│pб@б@б@орвiвiвi∙°\r\n" + 
				"∙свдвдб║вдвдвдвдвдвдвд∙с\r\n" + 
				"б@б@б@б@╝pй╨б@б@б@б@\r\n" + 
				"");
	}

	public static void main(String[] args) throws IOException {
//		roomXiaoYao_1();
//		roomXiaoYao_2();
//		SecondFloor();
//		SecondFloor_1();
//		lobby();
//		room1();
//		room2();
//		room3();
}
}